package com.zeacen.question.activity;

import android.view.View;
import android.widget.RelativeLayout;
import android.widget.TextView;

import com.zeacen.question.MainActivity;
import com.zeacen.question.R;
import com.zeacen.question.app.AppActivityManager;
import com.zeacen.question.base.BaseActivity;

import butterknife.BindView;

/**
 * Created by Administrator on 2018/9/20.
 */

public class ResultDetailActivity extends BaseActivity {
    @BindView(R.id.tv_detail)
    TextView tv_detail;
    @BindView(R.id.rl_fanhui)
    RelativeLayout rl_fanhui;
    String detail = "",jieguo = "";
    String pinghe = "平和质调养指导方案\n" +
            "1.调摄原则：顺其自然，适当运动，营养丰富，处事中正。\n" +
            "2.环境起居：生活起居顺应一年四季气候特点，保证充足睡眠。\n" +
            "3.形体运动：根据个人体力可进行太极拳（剑）、五禽戏、八段锦、散步等柔缓的运动。也可选择跑步、篮球、排球、足球、踢毽子、跳交谊舞、健身操、抖空竹等运动量较大的项目。\n" +
            "4.精神调适：开朗乐观，心态平和，与人为善，和谐上进，乐于合作。\n" +
            "5.饮食调理：饮食宜营养丰富，荤素合理搭配，不可偏食。进食应有所节制，不可过饥过饱，不要偏寒偏热。少吃油盐。\n" +
            "6.药物调养：不需药物调摄。\n" +
            "7.音乐及其他调摄：根据个人喜好选择音乐，各种风格的可以交替欣赏。坚持点按足三里、涌泉等保健穴位。\n";
    String qixu = "气虚质调养指导方案\n" +
            "1.调摄原则：避免劳累，食宜甘温，药宜益气。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：根据个人体力选择太极拳（剑）、五禽戏、八段锦、散步、慢跑或放风筝、打门球等偏于柔缓的运动。不宜作剧烈运动，避免激烈的竞赛及冬泳等。\n" +
            "4.精神调适：适当多休息。欣赏书法、绘画、戏曲或养喂花鸟鱼虫等。多知足，少攀比，不可躁动，避免过度思虑。\n" +
            "5.饮食调理：常吃粳米、糯米、小米、黍米、山药、土豆、大枣、胡萝卜、香菇、鹅肉、鹌鹑、牛肉、兔肉、鲢鱼、鳜鱼、鳝鱼等。少吃青萝卜、槟榔等耗气食物。饮茶宜选红茶，不宜多饮绿茶。药膳可用茯苓粳米粥（茯苓12克，粳米100克）、山药桂圆粥（山药100克，桂圆15克）等。少吃油、盐。\n" +
            "6.药物调养：可用人参、黄芪、党参、太子参、白术等。\n" +
            "7.音乐及其它调摄：欣赏具有田园、山野等自然风格的乐曲。\n";
    String yangxu = "阳虚质调养指导方案\n" +
            "1.调摄原则：避免劳累，食宜甘温，药宜温补。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：动作宜柔缓。根据个人体力选择太极拳（剑）、五禽戏、八段锦、散步、慢跑或放风筝、打门球等。\n" +
            "4.精神调摄：欣赏书法、绘画、戏曲或养喂花鸟鱼虫等。\n" +
            "5.饮食调理：常吃生姜、韭菜、荔枝、菠萝、桃、羊肉、狗肉等，少吃冰激凌、西瓜、梨等生冷之品。药膳可用当归生姜羊肉汤（当归15克、生姜五片、羊肉100克）、韭菜炒胡桃仁（胡桃仁20克、韭菜30克）。少吃油盐。\n" +
            "6.药物调养：宜用巴戟天、肉苁蓉、补骨脂、杜仲、菟丝子、狗脊等。\n" +
            "7.音乐及其它调摄：可多听欢快、喜庆的音乐。坚持每晚用热水（40～45度）泡脚15分钟。可按揉足三里、合谷、涌泉穴。艾灸（关元、大椎、命门），拔罐（肺俞、风门）。\n";
    String yinxu = "阴虚质调养指导方案\n" +
            "1.调摄原则：避免劳累，食宜甘润，药宜养阴。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：宜根据个人体力选动静结合项目，如太极拳（剑）、八段锦、五禽戏、游泳或传统健身项目“六字诀”中的“吹字诀”。\n" +
            "4.精神调摄：养成冷静、沉着的性格，保持稳定的心态，切忌急躁。少与人争，以减少激怒，少参加竞赛性的文娱活动。\n" +
            "5.饮食调理：多食甘凉滋润食物，如银耳、茼蒿、雪梨、木瓜、无花果、鸭肉、冰糖、百合、菠菜等。少吃葱、姜、蒜、辣椒等辛辣燥烈之品。药膳可用沙参粥（沙参15克、粳米100克、冰糖5粒）、百合粥（粳米100克、百合15克、白砂糖10～20克）、枸杞粥（枸杞20克、粳米100克）、桑椹粥（桑椹30克、粳米60克）。少吃油盐。\n" +
            "6.药物调养：可选用女贞子、山茱萸、五味子、旱莲草、麦门冬、天门冬、生地黄、熟地黄、黄精、玉竹、枸杞子、桑椹等药。成方宜选六味地黄丸。\n" +
            "7.音乐及其它调摄：可多听舒缓音乐。自行按揉太溪、三阴交、照海穴，轻揉涌泉。\n";
    String tanshi = "痰湿质调养指导方案\n" +
            "1.调摄原则：加强运动，食宜清淡，药宜温化。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：长期坚持运动锻炼，如太极拳（剑）、八段锦、站桩功、揉腹功、步行、快走、慢跑、竞走、登山、游泳、骑自行车、健身舞、跳绳、韵律操等。\n" +
            "4.精神调摄：尽量多参加社会活动，培养广泛的兴趣爱好。\n" +
            "5.饮食调理：宜常吃冬瓜、红小豆、扁豆、白萝卜、南瓜、紫菜、洋葱、薏苡仁、包菜、茯苓等。忌吃饴糖、柚子、李子、柿子、砂糖、肥肉及油腻的食物。勿暴饮暴食，忌吃生冷性寒之品，少吃贝类海产品。少吃油盐。\n" +
            "6.药物调养：可用苍术、白术、砂仁、陈皮、泽泻、瓜蒌、荷叶、橘红、猪苓、冬瓜皮等。可用荷叶15g，泡水当茶饮，每天适量频服。中成药可选用二陈丸。\n" +
            "7.音乐及其他调摄：多听一些激昂高亢的进行曲、励志歌曲、戏曲，多看一些表现力量、对抗性强的体育比赛。可常点按丰隆、中脘、足三里、阴陵泉等穴位。\n";
    String shire = "湿热质调养指导方案\n" +
            "1.调摄原则：加强运动，食宜清淡，药宜清利。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：长期坚持运动锻炼，如太极拳（剑）、八段锦、站桩功、揉腹功、步行、快走、慢跑、竞走、登山、游泳、骑自行车、健身舞、跳绳、韵律操等。\n" +
            "4.精神调适：尽量多参加社会活动，培养广泛的兴趣爱好。\n" +
            "5.饮食调理：可常吃红小豆、绿豆、薏苡仁、芹菜、黄瓜、冬瓜、藕、荠菜等食物，可适量吃苦瓜、苦苣、西瓜等。食忌辛温、滋腻，少吃韭菜、辣椒、花椒、生姜、羊肉或火锅、烹炸、烧烤等食物，以及肥肉、粘糕、鲇鱼等粘腻食物。可用石竹茶、苦丁茶、莲子芯、竹叶、玉米须等泡茶饮。少吃油盐。\n" +
            "6.药物调养：可用佩兰、栀子、龙胆草、茵陈、苦参、泽泻等。脾胃湿热者用泻黄散。肝胆湿热者，用龙胆泻肝丸。\n" +
            "7.音乐及其他调摄：可经常听一些悠闲、和缓的音乐。经常点按阴陵泉、曲池等穴位。也可常做大椎穴拔罐、督脉或膀胱经刮痧等疗法。\n";
    String xueyu = "血瘀质调养指导方案\n" +
            "1.调摄原则：加强运动，食宜辛温，药宜活血。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：根据个人体力加强户外运动，强度要适中，如太极拳（剑）、舞蹈、步行健身法、徒手健身操、健身球、登山、乒乓球、羽毛球、扭秧歌、跳交谊舞等。\n" +
            "4.精神调适：培养乐观向上的情绪，宜常看喜剧、滑稽剧、励志电影、电视，听相声，勿看悲剧。\n" +
            "5.饮食调理：宜食山楂、金橘、玫瑰花、月季花、田七苗、黑豆等。忌吃乌梅、苦瓜、柿子、李子、石榴等酸涩之品。少吃蛋黄、蟹子、猪肉、奶酪等。适量饮用葡萄酒、黄酒等。药膳可选用山楂汤（山楂20克加少许红糖）、当归田七乌鸡汤（乌鸡250克、当归15克、田七10克、生姜五片）。少吃油盐。\n" +
            "6.药物调养：可用当归、红花、川芎、丹参、赤芍、鸡血藤、桃仁等。可选用桃红四物汤、血府逐瘀汤、复元活血汤、复方丹参片等。\n" +
            "7.音乐及其他调摄：选择激昂高亢、令人振奋的音乐，以培养开朗、豁达的性格。可舒缓按揉膻中、血海、太冲、三阴交、委中、曲泽等穴位，或者拔罐（膈俞、肝俞）、刮痧（督脉或膀胱经）。\n";
    String qiyu = "气郁质调养指导方案\n" +
            "  1.调摄原则：形神宜动，食宜辛温，药宜理气。\n" +
            "  2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "  3.形体运动：尽量进行户外活动，适度加大运动量，如跑步、登山、打乒乓球、打羽毛球、扭秧歌、跳交谊舞等。\n" +
            "  4.精神调适：培养乐观向上的情绪，宜常看喜剧、滑稽剧、励志电影、电视，听相声，勿看悲剧。\n" +
            "  5.饮食调理：宜饮花茶，少量饮酒。宜常吃茴香、佛手、萝卜、橙子、柑子、刀豆、金橘等。少吃酸菜、乌梅、石榴、青梅、杨梅、酸枣、李子、柠檬等。药膳宜用橘皮粳米粥（橘皮50g、粳米100g）或山药佛手冬瓜汤（山药50克、佛手50克、冬瓜150克）。少吃油盐。\n" +
            "  6.药物调养：可用香附、香橼、柴胡、枳壳、麦芽、青皮、陈皮等。中成药可选用逍遥丸、柴胡疏肝散、越鞠丸等。\n" +
            "  7.音乐及其他调摄：宜选择激昂高亢、令人振奋的音乐，以培养开朗、豁达的性格。每天叩拍膻中穴10～30次，或进行5分钟推腹法。也可点按内关、太冲、期门等穴位。\n";
    String tebin = "特禀质调养指导方案\n" +
            "1.调摄原则：加强运动，避免接触过敏原，药遵医嘱。\n" +
            "2.环境起居：春天早睡早起，夏天晚睡早起、适当午睡，秋天早睡早起，冬天早睡晚起。\n" +
            "3.形体运动：积极参加各种体育锻炼，可根据个人体力选择太极拳（剑）、强壮功、瑜伽、步行、慢跑等。\n" +
            "4.精神调摄：多关注具有积极意义的事物，培养乐观情绪，避免情绪紧张。\n" +
            "5.饮食调理：避免食用各种致敏食物或来源、性味不明的食物。少食荞麦、蚕豆、辣椒、虾、蟹等食物。少吃油盐。\n" +
            "6.药物调养：在医师指导下，可选用乌梅、五味子、银柴胡等药物。药膳可用乌梅粥（乌梅15g，黄芪20g，当归12g）。\n" +
            "7.音乐及其他调摄：根据个人喜好选择音乐，各种风格的可以交替欣赏。可按揉迎香、鼻通穴、印堂穴，捏鼻、擦鼻翼等各1～2分钟，每日早晚各一次。可艾灸肺俞、风门、曲池、合谷。\n";

    @Override
    public void initRootView() {
        setContentView(R.layout.activity_resultdetail);
    }

    @Override
    public void initView() {
        detail = getIntent().getExtras().getString("detail");
        //tv_detail.setText(detail);
    }

    @Override
    public void initData() {
        if (detail.contains("平和")){
            jieguo = pinghe;
        }
        if (detail.contains("气虚")){
            jieguo = jieguo+qixu;
        }
        if (detail.contains("阳虚")){
            jieguo = jieguo+yangxu;
        }
        if (detail.contains("阴虚")){
            jieguo = jieguo+yinxu;
        }
        if (detail.contains("痰湿")){
            jieguo = jieguo+tanshi;
        }
        if (detail.contains("湿热")){
            jieguo = jieguo+shire;
        }
        if (detail.contains("血瘀")){
            jieguo = jieguo+xueyu;
        }

        if (detail.contains("气郁")){
            jieguo = jieguo+qiyu;
        }
        if (detail.contains("特禀")){
            jieguo = jieguo+tebin;
        }
        tv_detail.setText(jieguo);
    }

    @Override
    public void initListener() {
        rl_fanhui.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                AppActivityManager.getInstance().finishNotMainActivity();
            }
        });
        //
    }
}
